Repository: mozilla-l10n/mt-training-data
Catalog: ug/ug_pontoon.tmx
Source language: en_us
Languages: ug

source: Exceeded the maximum number of tabs (%1$s) that can be generated in one operation
ug: بىر مەشغۇلاتتا ھاسىللايدىغان ئەڭ كۆپ بەتكۈچ (%1$s) سانىدىن ئېشىپ كەتتى

source: Exceptions
ug: مۇستەسنا

source: Exceptions let you disable tracking protection for selected sites.
ug: تاللانغان تور بېكەتلەرگە مۇستەسنا تەڭشەپ، ئىزلاشتىن قوغدىيالايسىز.

source: Exchange messages with apps other than this one
ug: باشقا ئەپ بىلەن ئۇچۇر ئالماشتۇرىدۇ

source: Exit multiselect mode
ug: كۆپ تاللاش ھالىتىدىن چېكىنىش

source: expand
ug: ياي

source: expanded
ug: يېيىلدى

source: Expand group of synced tabs
ug: قەدەمداشلانغان بەتكۈچ گۇرۇپپىسىنى يايىدۇ

source: Expand inactive tabs
ug: ئاكتىپسىز بەتكۈچلەرنى يايىدۇ

source: Expand saved addresses
ug: ساقلانغان ئادرېسنى ياي

source: Expand saved cards
ug: ساقلانغان كارتىنى ياي

source: Expand saved passwords
ug: ساقلىغان ئىمنى ياي

source: Expand suggested addresses
ug: تەۋسىيە ئادرېسنى كېڭەيتىدۇ

source: Expand suggested credit cards
ug: تەۋسىيە قىلىنغان ئىناۋەتلىك كارتىنى كېڭەيتىدۇ

source: Expand suggested logins
ug: تەۋسىيە كىرىشنى كېڭەيتىدۇ

source: Expiration Date
ug: مۇددىتى توشىدىغان چېسلا

source: Expiration Date Month
ug: مۇددىتى توشىدىغان چېسلا ئاي

source: Expiration Date Year
ug: مۇددىتى توشىدىغان چېسلا يىل

source: Explore add-ons
ug: قوشۇلما ئىزدەش

source: Explore extensions
ug: كېڭەيتىلمە بايقاش

source: Explore more extensions
ug: تېخىمۇ كۆپ كېڭەيتمە بايقايدۇ

source: Explore more extensions.
ug: تېخىمۇ كۆپ كېڭەيتمە بايقايدۇ.

source: Explore more wallpapers
ug: تېخىمۇ كۆپ تام قەغەزنى ئىزدەيدۇ

source: Extend developer tools to access your data in open tabs
ug: ئىجادكارلار قورالى سىز ئاچقان بەتكۈچتىكى سانلىق مەلۇماتلارنى زىيارەت قىلالايدۇ

source: Extension collection modified. Quitting the application to apply changes…
ug: كېڭەيتىلمە توپلىمى ئۆزگەردى. ئۆزگەرتىشنى قوللىنىش ئۈچۈن پىروگراممىدىن چېكىنىۋاتىدۇ…

source: Extensions
ug: كېڭەيتمە

source: Extensions are temporarily disabled
ug: كېڭەيتمە ۋاقىتلىق چەكلەنگەن

source: Extensions level up your browsing, from changing how %s looks and performs to boosting privacy and safety.
ug: كېڭەيتىلمە %s نىڭ كۆرۈنۈش ۋە ئىجرا قىلىش ئۇسۇلىنى تەڭشەپ، شەخسىيەت ۋە بىخەتەرلىكنى كۈچەيتىپ توركۆرگۈ تەسىراتىڭىزنى ياخشىلايدۇ.

source: Extensions Manager
ug: كېڭەيتمە باشقۇرۇش

source: Extensions, navigate up
ug: كېڭەيتمە، ئۈستىگە يول باشلا

source: Extension updates
ug: كېڭەيتىلمە يېڭىلانمىسى

source: External download manager
ug: سىرتقى چۈشۈرۈش باشقۇرغۇچ

source: Failed to disable %1$s
ug: %1$s نى چەكلىيەلمىدى

source: Failed to enable %1$s
ug: %1$s نى قوزغىتىش مەغلۇپ بولدى

source: Failed to install %1$s
ug: %1$s نى ئورنىتىش مەغلۇپ بولدى

source: Failed to install this add-on.
ug: بۇ قوشۇلمىنى ئورنىتالمىدى.

source: Failed to install this extension.
ug: بۇ كېڭەيتىلمىنى ئورنىتالمىدى.

source: Failed to query Add-ons!
ug: قىستۇرما ئىزدەش مەغلۇب بولدى!

source: Failed to query Extensions!
ug: كېڭەيتىلمىنى سۈرۈشتۈرەلمىدى!

source: Failed to remove %1$s
ug: %1$s نى چىقىرىۋېتەلمىدى

source: Failed to uninstall %1$s
ug: %1$s نى ئۆچۈرەلمىدى

source: Feb
ug: فېۋرال

source: File Not Found
ug: ھۆججەت تېپىلمىدى

source: Files and media permission access needed to download files. Go to Android settings, tap permissions, and tap allow.
ug: ھۆججەت چۈشۈرۈشتە ھۆججەت ۋە ۋاسىتە زىيارەت قىلىش ئىجازىتىگە ئېھتىياجلىق. ئاندىرويىد تەڭشەككە يۆتكىلىپ، ھوقۇقنى چېكىپ، يول قوينى چېكىڭ.

source: Fill and save usernames and passwords in websites while using %1$s.
ug: %1$s نى ئىشلەتكەندە توربېكەتتىكى ئىشلەتكۈچى ئىسمى ۋە پارولىنى تولدۇرىدۇ ۋە ساقلايدۇ.

source: Fill link from clipboard
ug: چاپلاش تاختىسىدىكى ئۇلىنىشنى ئېچىش

source: Fill usernames and passwords in other apps on your device.
ug: ئۈسكۈنىڭىزدىكى باشقا ئەپلەردە ئىشلەتكۈچى ئىسمى ۋە ئىمنى تولدۇرىدۇ.

source: Find in page
ug: بەت ئىچىدىن ئىزدەش

source: Find in page…
ug: بەتتىن ئىزدە…

source: Find more add-ons
ug: تېخىمۇ كۆپ قوشۇلما ئىزدە

source: Find more extensions
ug: تېخىمۇ كۆپ كېڭەيتمە ئىزدە

source: Find next result
ug: كېيىنكى نەتىجىنى ئىزدە

source: Find out if you can trust this product’s reviews — before you buy.
ug: سېتىۋېلىشتىن بۇرۇن بۇ مەھسۇلاتنىڭ باھالىنىشىنىڭ ئىشەنچلىك ياكى ئەمەسلىكىنى بىلىپ بېقىڭ.

source: Find out why millions love Firefox
ug: مىليونلىغان كىشىنىڭ نېمىشقا Firefox نى ياقتۇرىدىغانلىقىنى تېپىڭ

source: Find previous result
ug: ئالدىنقى نەتىجىنى ئىزدە

source: Find something nearby. Or discover something fun.
ug: ئەتراپتىكى نەرسىلەرنى ئىزدەڭ. ياكى قىزىقارلىق ئىشلارنى بايقاڭ.

source: Find what you need faster, from private browsing to save actions.
ug: مەيلى شەخسىي زىيارەت ھالىتى ياكى ساقلاش مەشغۇلاتى بولسۇن، لازىملىق ئىقتىدارلارنى ئاسانلا تاپقىلى بولىدۇ.

source: Fingerprinters
ug: بارماق ئىزى ئىزلىغۇچ

source: Firefox Account
ug: ئوتتۈلكە ھېساباتى

source: Firefox Account/Sync server modified. Quitting the application to apply changes…
ug: Firefox ھېساباتى/قەدەمداش مۇلازىمېتىرى ئۆزگەرتىلدى. پىروگراممىنىڭ ئۆزگەرتىش ئىلتىماسىدىن ۋاز كېچىۋاتىدۇ…

source: Firefox add-on technology is modernizing. These add-ons use frameworks that are not compatible with Firefox 75 & beyond.
ug: Firefox قوشۇلما تېخنىكىسى زامانىۋىلىشىۋاتىدۇ. بۇ قوشۇلما Firefox 75 ۋە ئۇنىڭدىن يۇقىرى نەشرىگە ماسلاشمايدىغان رامكىلارنى ئىشلىتىدۇ.

source: Firefox can close tabs you haven’t viewed over the past month.
ug: Firefox ئۆتكەن بىر ئايدا كۆرمىگەن بەتكۈچلەرنى تاقىۋېتەلەيدۇ.

source: Firefox encrypts your passwords, bookmarks, and more when you’re synced.
ug: قەدەمداشلىسىڭىز Firefox ئىم، خەتكۈچلىرىڭىزنى شىفىرلايدۇ.

source: Firefox is fast and private
ug: Firefox تېز ھەم شەخسىي

source: Firefox logo
ug: Firefox تۇغى

source: Firefox privacy notice
ug: Firefox شەخسىيەت ئۇقتۇرۇشى

source: Firefox puts people over profits and defends your privacy by blocking cross-site trackers.\n\nLearn more in our privacy notice.
ug: Firefox تور بېكەتتىكى ئىز قوغلىغۇچلارنى توسۇش ئارقىلىق كىشىلەرنى مەنپەئەتتىن ئۈستۈن قىلىدۇ ۋە شەخسىيىتىڭىزنى قوغدايدۇ.\n\nشەخسىيەت ئۇقتۇرۇشىمىزدىن كۆپرەك ئۆگىنەلەيسىز.

source: Firefox Suggest
ug: Firefox تەكلىپى

source: First Name
ug: ئىسمى

source: FOLDER
ug: قىسقۇچ

source: Follow device language
ug: ئۈسكۈنە تىلىغا ئەگەشسۇن

source: Follow device theme
ug: ئۈسكۈنە ئۆرنىكىگە ئەگىشىدۇ

source: Font Size
ug: خەت چوڭلۇقى

source: Font size decrease
ug: خەت كىچىكلىتىش

source: Font size increase
ug: خەت چوڭايتىش

source: Font size will match your Android settings. Disable to manage font size here.
ug: خەت چوڭلۇقى ئاندىرويىد تەڭشىكىڭىزگە ماسلىشىدۇ. بۇ يەردە خەت چوڭلۇقىنى باشقۇرۇشنى چەكلىگىلى بولىدۇ.

source: Forward
ug: ئالدىغا

source: For your privacy, translations never leave your device. New languages and improvements coming soon! %1$s
ug: شەخسىي مەخپىيەتلىكىڭىز ئۈچۈن تەرجىمىلەر ئۈسكۈنىڭىزدىن ھەرگىز ئايرىلمايدۇ. پات يېقىندا يېڭى تىل ۋە ياخشىلىنىشلار قوشۇلىدۇ! %1$s

source: Frees up storage space
ug: ساقلىغۇچ بوشلۇقىنى بوشىتىدۇ

source: Front-facing camera
ug: ئالدى كامېرا

source: Full screen site controls
ug: بېكەت پۈتۈن ئېكران كونترولى

source: Gathering crash data
ug: يىمىرىلىش سانلىق مەلۇماتلىرىنى توپلاۋاتىدۇ

source: Gathering crash telemetry data
ug: يىمىرىلىش تېلېگراف سانلىق مەلۇماتلىرىنى توپلاۋاتىدۇ

source: Gestures
ug: قول ئىشارىسى

source: Get data from the clipboard
ug: چاپلاش تاختىسىدىن سانلىق مەلۇماتقا ئېرىشىش

source: Get started
ug: باشلاڭ

source: Get suggestions from the web related to your search
ug: توردىن ئىزدىگىنىڭىزگە مۇناسىۋەتلىك تەكلىپكە ئېرىشىڭ

source: Glean Debug Tools
ug: Glean سازلاش قورالى

source: Go Back
ug: قايتىش

source: Go Back (Recommended)
ug: قايتىش (تەۋسىيە)

source: Google Search
ug: Google ئىزدەش

source: Got it
ug: بىلدىم

source: Go to settings
ug: تەڭشەكنى ئاچ

source: Go to Settings
ug: تەڭشەككە يۆتكەل

source: Grab tabs and passwords from your other devices to pick up where you left off.
ug: باشقا ئۈسكۈنىلىرىڭىزدىكى بەتكۈچ ۋە ئىملارنى قەدەمداشلاپ، كەلگەن جايدىن داۋاملاشتۇرالايسىز.

source: Grid
ug: سېتكا

source: Group deleted
ug: گۇرۇپپا ئۆچۈرۈلدى

source: Harmful site issue
ug: زىيانلىق تور بېكەت مەسىلىسى

source: Help make %1$s better for everyone. Mozilla employees use the info you send to fix website problems.
ug: ھەممە ئىشلەتكۈچىنىڭ %1$s ئىشلىتىش تەسىراتىنى ياخشىلاشقا ياردەم بېرىدۇ. Mozilla خىزمەتچىلىرى سىز يوللىغان ئۇچۇرغا ئاساسەن تور بېكەت مەسىلىسىنى ئوڭشايدۇ.

source: Help make printing in Firefox better. It only takes a sec
ug: Firefox نىڭ بېسىشىنى ياخشىلاشقا ياردەم بېرىڭ. ئازراقلا ۋاقىت كېتىدۇ

source: Help make search in Firefox better. It only takes a minute
ug: Firefox تىكى ئىزدەش ئىقتىدارىنى ياخشىلاشقا ياردەملىشىڭ. پەقەت بىر مىنۇت ۋاقىت كېتىدۇ

source: Help make sync in Firefox better. It only takes a minute
ug: Firefox قەدەمداش ئىقتىدارىنى ياخشىلاشقا ياردەملىشىڭ. پەقەت بىر مىنۇت ۋاقىت كېتىدۇ

source: Help us make Firefox better
ug: Firefox نى تېخىمۇ ياخشى قىلىشىمىزغا ياردەملىشىدۇ

source: Help us make Firefox better. It only takes a minute.
ug: Firefox نى ياخشىلىشىمىزغا ياردەم قىلىڭ. بۇنىڭغا پەقەت بىر مىنۇتلا ۋاقىت كېتىدۇ.

source: Hide and show browser tabs
ug: توركۆرگۈ بەتكۈچىنى يوشۇرىدۇ ۋە كۆرسىتىدۇ

source: Hide password
ug: ئىم يوشۇر

source: Highlighted
ug: ئالاھىدە

source: Highlights from recent reviews
ug: يېقىنقى باھالاردىن يارقىن نۇقتىلار

source: History
ug: تارىخ

source: History Deleted
ug: تارىخ ئۆچۈرۈلدى

source: Homepage
ug: باشبەت

source: Homepage after four hours of inactivity
ug: تۆت سائەت ئىشلەتمىسە باش بەتكە قايتىدۇ

source: Home screen
ug: باش ئېكران

source: Hop from phone to laptop and back
ug: تېلېفوندىن يان كومپيۇتېر ئارىسىدا تېز ئالماشتۇرىدۇ

source: Hostname required
ug: مۇلازىم ئىسمى زۆرۈر

source: However, it’s also possible that an attacker is involved. If you continue to the website, you should not enter any sensitive info. If you continue, HTTPS-Only mode will be turned off temporarily for the site.
ug: شۇنداقتىمۇ، تور ھۇجۇمچىلىرىنىڭ ھۇجۇمىغا ئۇچرىشى مۇمكىن. ئەگەر بۇ تور بېكەتنى زىيارت قىلىشنى داۋاملاشتۇرسىڭىز، ھېچقانداق سەزگۈر ئۇچۇرنى كىرگۈزمەڭ. ئەگەر داۋاملاشتۇرسىڭىز، بۇ تور بېكەت ئۈچۈن HTTPS لا ھالىتى ۋاقىتلىق تاقىلىدۇ.

source: How reliable are these reviews?
ug: بۇ باھالار قانچىلىك ئىشەنچلىك؟

source: How satisfied are you with printing in Firefox?
ug: Firefox نىڭ بېسىش ئىقتىدارىغا بولغان رازىمەنلىكىڭىز قانداق؟

source: How satisfied are you with the search experience in Firefox?
ug: Firefox نىڭ ئىزدەش كەچمىشىگە بولغان رازىمەنلىكىڭىز قانداق؟

source: How satisfied are you with the sync experience in Firefox?
ug: Firefox نىڭ قەدەمداش كەچمىشىگە بولغان رازىمەنلىكىڭىز قانداق؟

source: How satisfied are you with your Firefox homepage?
ug: سىزنىڭ Firefox ئىشلىتىشتىكى مەمنۇنلۇق تەسىراتىڭىز قانداق؟

source: how %s by Mozilla determines review quality
ug: Mozilla قانداق قىلىپ %s نىڭ تەكشۈرۈش سۈپىتىنى بەلگىلەيدۇ

source: how %s determines review quality
ug: %s تەكشۈرۈش سۈپىتىنى قانداق بەلگىلەيدۇ

source: How we determine review quality
ug: تەكشۈرۈش سۈپىتىنى قانداق بېكىتىمىز

source: HTTPS-Only Mode
ug: ساپ HTTPS ھالىتى

source: I don’t use it
ug: ئىشلەتمەيمەن

source: I don’t use search on Firefox
ug: مەن Firefox تا ئىزدەشنى ئىشلەتمەيمەن

source: I don’t use sync
ug: قەدەمداشنى ئىشلەتمەيمەن

source: If allowed, private tabs will also be visible when multiple apps are open
ug: ئەگەر يول قويۇلسا، كۆپ ئەپ ئېچىلغاندا شەخسىي بەتكۈچلەرمۇ كۆرۈنىدۇ

source: If you close all Private tabs now, %1$s download will be canceled. Are you sure you want to leave Private Browsing?
ug: ئەگەر ھازىر ھەممە شەخسىيەت بەتكۈچنى تاقىسىڭىز، %1$s چۈشۈرۈشتىن ۋاز كېچىدۇ. راستىنلا شەخسىي زىيارەت ھالىتىدىن چېكىنەمسىز؟

source: If you delete all languages, %1$s will download partial languages to your cache as you translate.
ug: ئەگەر ھەممە تىلنى ئۆچۈرسىڭىز، %1$s تەرجىمە قىلغاندا تىلنى قىسمەن ھالدا غەملەككە چۈشۈرىدۇ.

source: If you delete this language, %1$s will download partial languages to your cache as you translate.
ug: ئەگەر بۇ تىلنى ئۆچۈرسىڭىز، %1$s تەرجىمە قىلغاندا تىلنى قىسمەن ھالدا غەملەككە چۈشۈرىدۇ.

source: If you see this product is back in stock, report it and we’ll work on checking the reviews.
ug: ئەگەر بۇ مەھسۇلاتتىن مال بارلىقىنى بايقىسىڭىز، دوكلات قىلسىڭىز، بىز باھالاشنى تەكشۈرەلەيمىز.

source: If you trust this extension, you can give it permission on every website.
ug: ئەگەر بۇ كېڭەيتىلمىگە ئىشەنسىڭىز، ئۇنى ھەممە تور بېكەتتە ئىشلىتىشكە ئىجازەت بەرسىڭىز بولىدۇ.

source: Image copied to clipboard
ug: سۈرەت چاپلاش تاختىسىغا كۆچۈرۈلدى

source: Images or videos
ug: سۈرەت ياكى سىن

source: Inactive
ug: ئىشلەتمىگەن

source: Inactive tabs
ug: ئاكتىپسىز بەتكۈچ

source: In all tabs
ug: ھەممە بەتكۈچتە

source: Include information like numbers, email and shipping addresses
ug: سان، ئېلخەت ۋە توشۇش ئادرېسى قاتارلىق ئۇچۇرلارنى ئۆز ئىچىگە ئالىدۇ

source: Includes phone numbers and email addresses
ug: تېلېفون نومۇرى ۋە ئېلخەت ئادرېسىنى ئۆز ئىچىگە ئالىدۇ

source: Info coming soon
ug: ئۇچۇر پات يېقىندا كېلىدۇ

source: In progress
ug: ئىلگىرىلەش

source: Input data to the clipboard
ug: چاپلاش تاختىسىغا سانلىق مەلۇمات كىرگۈزۈش

source: Install
ug: قاچىلاش

source: Install %1$s
ug: %1$sنى ئورنات

source: Install Add-on
ug: قىستۇرما قاچىلاش

source: Install add-on from file
ug: ھۆججەتتىن قوشۇلما ئورنىتىدۇ

source: Installed
ug: قاچىلاندى

source: Installed add-on icon
ug: ئورنىتىلغان قوشۇلما سىنبەلگىسى

source: Install extension from file
ug: ھۆججەتتىن كېڭەيتىلمە ئورنىتىدۇ

source: Installing add-on icon
ug: قوشۇلما سىنبەلگىسىنى ئورنىتىۋاتىدۇ

source: Invalid Address
ug: ئىناۋەتسىز ئادرېس

source: Invalid URL
ug: ئىناۋەتسىز تور ئادرېسى

source: Isolate cross-site cookies
ug: بېكەت ھالقىغان Cookies نى ئايرىۋېتىدۇ

source: Item Menu for %s
ug: %s نىڭ تۈر تىزىملىكى

source: It requires your permission to:
ug: تۆۋەندىكى ھوقۇقلارنى تەلەپ قىلىدۇ:

source: It wants to:
ug: ئۇنىڭ ئۈمىدى:

source: Jan
ug: يانۋار

source: Jul
ug: ئىيۇل

source: Jump back in
ug: ئالدىنقى بەتكە قايت

source: Jun
ug: ئىيۇن

source: Known Fingerprinters
ug: مەلۇملۇق ئىز قالدۇرغۇ

source: Known trackers? Blocked automatically. Extensions? Try all 700. PDFs? Our built-in reader makes them easy to manage.
ug: بىلىنگەن ئىزلىغۇچ؟ ئۆزلۈكىدىن توسۇلىدۇ. كېڭەيتمە؟ 700 دىن ئارتۇقنى سىناڭ. PDF نى ئاچامدۇ؟ توركۆرگۈ ئىچىدىكى ئوقۇغۇچ ئۇلارنى باشقۇرۇشنى قۇلايلاشتۇرىدۇ.

source: Know your rights
ug: ھوقۇقىڭىزنى بىلىۋېلىڭ

source: <label> <b>%1$s</b> has a security policy called HTTP Strict Transport Security (HSTS), which means that <b>%2$s</b> can only connect to it securely. You can’t add an exception to visit this site. </label>
ug: <label><b>%1$s</b>نىڭ HTTP قاتتىق قاتناش بىخەتەرلىكى (HSTS) دەپ ئاتىلىدىغان بىخەتەرلىك سىياسىتى بار ، يەنى <b>%2$s </b> پەقەت بىخەتەر ئۇلىنالايدۇ. بۇ تور بېكەتنى زىيارەت قىلىش ئۈچۈن مۇستەسنا قوشالمايسىز. </label>

source: Label for entering a text input field
ug: تېكىست كىرگۈزۈش بۆلىكىنىڭ بەلگىسى

source: <label>Someone could be trying to impersonate the site and you should not continue.</label> <br><br> <label>Websites prove their identity via certificates. %1$s does not trust <b>%2$s</b> because its certificate issuer is unknown, the certificate is self-signed, or the server is not sending the correct intermediate certificates.</label>
ug: <label>بەزىلەر تور بېكەتنى تەقلىد قىلىشقا ئۇرۇنغان بولۇشى مۇمكىن، سىز داۋاملاشتۇرماسلىقىڭىز كېرەك.</label> <br> <br> <label> تور بېكەتلەر گۇۋاھنامە ئارقىلىق ئۆزىنىڭ كىملىكىنى ئىسپاتلايدۇ. %1$s <b>%2$s</b> غا ئىشەنمەيدۇ ، چۈنكى ئۇنىڭ گۇۋاھنامىسىنى تارقاتقۇچى نامەلۇم، گۇۋاھنامىگە ئۆزى ئىمزا قويغان ياكى مۇلازىمېتىر توغرا بولغان ئارىلىق گۇۋاھنامىنى ئەۋەتمىگەن. </label>

source: Last 30 days
ug: ئاخىرقى 30 كۈن

source: Last 7 days
ug: ئاخىرقى 7 كۈن

source: Last attempt:
ug: ئاخىرقى سىناق:

source: Last hour
ug: ئاخىرقى سائەت

source: Last Name
ug: تەگئات

source: Last synced: never
ug: ئاخىرقى قەدەمداش: ھەرگىز

source: Last synced: %s
ug: ئاخىرقى قەدەمداش: %s

source: Last tab
ug: ئاخىرقى بەتكۈچ

source: Last updated
ug: ئاخىرقى قېتىم يېڭىلانغان

source: Last used
ug: ئاخىرقى قېتىم ئىشلىتىلگەن

source: Later
ug: كېيىنچە

source: Launch your next private tab in one tap.
ug: بىر چېكىپلا كېيىنكى شەخسىيەت بەتكۈچنى قوزغىتالايسىز.

source: Learn About Sending Tabs…
ug: بەتكۈچ يوللاش ھەققىدىكى تەپسىلات…

source: Learn about Total Cookie Protection
ug: ئومۇميۈزلۈك Cookie دىن قوغداش ھەققىدىكى بىلدۈرگۈ

source: Learn more
ug: تەپسىلاتىنى بىلىش

source: Learn more about crash reports
ug: يىمىرىلىش دوكلاتى ھەققىدىكى تەپسىلات

source: Learn more about Firefox Suggest
ug: Firefox تەكلىپى ھەققىدىكى تەپسىلاتلار

source: Learn more about permissions
ug: ھوقۇق ھەققىدە تەپسىلاتلار

source: Learn more about %s.
ug: %s ھەققىدىكى تەپسىلاتلار.

source: Learn more about sync
ug: قەدەمداش ھەققىدىكى تەپسىلاتلار

source: Learn more about Sync.
ug: قەدەمداش ھەققىدىكى تەپسىلاتلار.

source: Learn more about usage data
ug: ئىشلىتىش سانلىق مەلۇماتى ھەققىدىكى تەپسىلات

source: Learn more in our privacy notice
ug: شەخسىيەت ئۇقتۇرۇشىنىڭ تەپسىلاتىنى ئوقۇڭ

source: Leave
ug: ئايرىل

source: Leave no traces on this device
ug: بۇ ئۈسكۈنىدە ئىز قالدۇرمايدۇ

source: Less distractions, less cookies tracking you on this site.
ug: بۇ تور بېكەتتە دىققەتنى چاچىدىغان ئىشلار ئاز، ساقلانما ئاز.

source: Libraries that we use
ug: بىز ئىشلىتىدىغان ئامبارلار

source: Library
ug: توپلام

source: Licensing information
ug: ئىجازەت ئۇچۇرى

source: Light
ug: يورۇق

source: Light color scheme
ug: سۇس رەڭ لايىھەسى

source: Limits the ability of social networks to track your browsing activity around the web.
ug: ئىجتىمائىي ئالاقە تورىنىڭ توردىكى پائالىيىتىڭىزنى ئىز قوغلاش ئىقتىدارىنى چەكلەيدۇ.

source: Link copied to clipboard
ug: ئۇلانما چاپلاش تاختىسىغا كۆچۈرۈلدى

source: Links
ug: ئۇلانما

source: Links available
ug: ئۇلانما بار

source: List
ug: تىزىم

source: Loading
ug: يۈكلەۋاتىدۇ

source: Location
ug: ئورنى

source: Logging in to %1$s with a %2$s account is subject to their <a href="%3$s">Privacy Policy</a> and <a href="%4$s">Terms of Service</a>
ug: بىر %2$s ھېساباتىدا %1$s غا تىزىمغا كىرىشتە ئۇلارنىڭ <a href="%3$s">شەخسىيەت تۈزۈمى</a> ۋە <a href="%4$s">مۇلازىمەت ماددىلىرى</a>غا بويسۇنىدۇ

source: Login options
ug: كىرىش تاللانمىلىرى

source: Logins
ug: كىرىش

source: Logins and passwords
ug: كىرىش ۋە ئىم

source: Logins and passwords that are not saved will be shown here.
ug: ساقلانمىغان كىرىش ۋە ئىم بۇ يەردە كۆرسىتىلىدۇ.

source: Logins and passwords will not be saved for these sites.
ug: بۇ تور بېكەتلەرنىڭ كىرىش ۋە ئىم ئۇچۇرلىرى ساقلانمايدۇ.

source: Looks like there’s a problem with your internet connection
ug: ئىنتېرنېت باغلىنىشىڭىزدا مەسىلە باردەك قىلىدۇ

source: Make Firefox your default browser
ug: Firefox نى كۆڭۈلدىكى توركۆرگۈ قىلىڭ

source: Make Firefox your go-to browser
ug: Firefox نى ئاساسىي تور كۆرگۈڭىزگە ئايلاندۇرۇڭ

source: Make %s your own
ug: %s نى ئۆز خاسلىقىڭىزغا ئايلاندۇرىدۇ

source: Make text on websites larger or smaller
ug: تور بېكەتلەردە تېكىستنى چوڭايتىدۇ ياكى كىچىكلىتىدۇ

source: Malware site issue
ug: يامان غەرەزلىك تور بېكەت مەسىلىسى

source: Manage account
ug: ھېسابات باشقۇرۇش

source: Manage addresses
ug: ئادرېس باشقۇرۇش

source: Manage alternative search engines
ug: باشقا ئىزدەش موتورلىرىنى باشقۇرۇش

source: Manage cards
ug: كارتا باشقۇرۇش

source: Manage credit cards
ug: ئىناۋەتلىك كارتا باشقۇرۇش

source: Manage extensions
ug: كېڭەيتىلمە باشقۇرۇش

source: Manage logins
ug: كىرىشنى باشقۇرۇش

source: Manage passwords
ug: ئىم باشقۇرۇش

source: Manage saved cards
ug: ساقلانغان كارتا باشقۇرۇش

source: Manage search shortcuts
ug: ئىزدەش قىسقا يولى باشقۇرۇش

source: Mar
ug: مارت

source: Marketing
ug: بازارچىلىق

source: Marketing data
ug: بازارچىلىق سانلىق مەلۇماتلىرى

source: May
ug: ماي

source: Media
ug: ۋاسىتە

source: Meet your personalized homepage. Recent tabs, bookmarks, and search results will appear here.
ug: خاسلاشتۇرۇلغان باش بېتىڭىز بىلەن تونۇشۇڭ. يېقىنقى بەتكۈچ، خەتكۈچ ۋە ئىزدەش نەتىجىسى بۇ يەردە كۆرۈنىدۇ.

source: Menu
ug: تىزىملىك

source: Microphone
ug: مىكروفون

source: Microphone 1
ug: مىكروفون 1

source: Microphone is on
ug: مىكروفون ئېچىلدى

source: Middle Name
ug: ئوتتۇرا ئىسمى

source: Mix of reliable and unreliable reviews
ug: ئىشەنچلىك ۋە ئىشەنچسىز باھالارنىڭ ئارىلاشمىسى

source: Monitor extension usage and manage themes
ug: كېڭەيتىلمە ئىشلىتىلىشىنى كۆزىتىدۇ ۋە ئۆرنەك باشقۇرىدۇ

source: More about this add-on
ug: قوشۇلما ھەققىدىكى تەپسىلات

source: More about this extension
ug: كېڭەيتمە ھەققىدىكى تەپسىلات

source: More colors. Better privacy. Same commitment to people over profits.
ug: تېخىمۇ رەڭدار. شەخسىيەت تېخىمۇ بىخەتەر. كىشىلەرنىڭ مەنپەئەتتىن ئۈستۈنلۈكىگە ۋەدە بېرىدۇ.

source: More options
ug: تېخىمۇ كۆپ تاللانما

source: More than 100 million people protect their privacy by choosing a browser that’s backed by a nonprofit.
ug: 100 مىليوندىن ئارتۇق كىشى پايدا تاپمايدىغان ئورگان قوللىغان توركۆرگۈنى تاللاپ ئىشلىتىپ ئۆزلىرىنىڭ شەخسىيىتىنى قوغداۋاتىدۇ.

source: More to consider
ug: تېخىمۇ كۆپ مەھسۇلاتلار

source: Most likely, the website simply does not support HTTPS.
ug: بەلكىم بو تور بېكەت HTTPS نى قوللىماسلىقى مۇمكىن.

source: Move
ug: يۆتكە

source: Move old tabs to inactive
ug: كونا بەتكۈچنى ئاكتىپسىز ھالەتكە يۆتكەيدۇ

source: Mozilla account
ug: Mozilla ھېسابات

source: Mozilla account/Sync server modified. Quitting the application to apply changes…
ug: Mozilla ھېسابات/قەدەمداش مۇلازىمېتىر تەڭشىكى ئۆزگەردى. ئۆزگىرىشنى قوللىنىش ئۈچۈن پىروگراممىدىن چېكىنىۋاتىدۇ…

source: Must have a title
ug: ماۋزۇ بولۇشى كېرەك

source: NAME
ug: ئىسىم

source: Name (A-Z)
ug: ئىسمى (A-Z)

source: Name collection
ug: يىغقۇچ ئاتاش

source: Name on Card
ug: كارتىدىكى ئىسىم

source: Navigate back
ug: كەينىگە قايت

source: Navigate up
ug: ئۈستىگە يول باشلا

source: Neutral
ug: ئادەتتىكى

source: Never
ug: ھەرگىز

source: Never save
ug: ھەرگىز ساقلىما

source: Never translate
ug: ھەرگىز تەرجىمە قىلمىسۇن

source: Never translate %1$s
ug: %1$s نى ھەرگىز تەرجىمە قىلمىسۇن

source: Never translate these sites
ug: بۇ تور بېكەتلەرنى تەرجىمە قىلمىسۇن

source: Never translate this site
ug: بۇ تور بەتنى تەرجىمە قىلمىسۇن

source: New add-on available
ug: يېڭى قىستۇرما بار

source: New add-ons available
ug: يېڭى قوشۇلما بار

source: New add-ons now available
ug: ھازىر يېڭى قوشۇلما بار

source: New extensions now available
ug: ھازىر يېڭى كېڭەيتىلمە بار

source: New folder
ug: يېڭى قىسقۇچ

source: New in %1$s
ug: %1$s دىكى يېڭىلىق

source: New info to check
ug: تەكشۈرىدىغان يېڭى ئۇچۇرلار

source: New: one-tap back and forward arrows
ug: يېڭى: ئالدىغا كەينىگە يا ئوقنى چېكىپ بەت ئالماشتۇرغىلى بولىدۇ

source: New private tab
ug: يېڭى شەخسىي بەتكۈچ

source: New private tab opened
ug: يېڭى شەخسىي بەتكۈچ ئېچىلدى

source: New: streamlined menu
ug: يېڭى: ئېقىم سىزىقلىق تىزىملىكى

source: New tab
ug: يېڭى بەتكۈچ

source: New tab opened
ug: يېڭى بەتكۈچ ئېچىلدى

source: No account? <u>Create one</u> to sync Firefox between devices.
ug: ھېساباتىڭىز يوق؟ <u> Firefox نى ئۈسكۈنىلەر ئارا قەدەمداشلاش ئۈچۈن بىرنى قۇرۇڭ </u>.

source: No add-ons here
ug: بۇ يەردە ھېچقانداق قوشۇلما يوق

source: No app found to open %1$s files
ug: %1$sھۆججىتىنى ئاچىدىغان ئەپ تېپىلمىدى

source: No bookmarks here
ug: ھېچقانداق خەتكۈچ يوق

source: No bookmarks yet
ug: ھېچقانداق خەتكۈچ يوق

source: No camera available on device
ug: كامېرا يوق ئىكەن

source: No crash reports have been submitted.
ug: يىمىرىلىش دوكلاتى تاپشۇرۇلمىدى.

source: No Devices Connected
ug: ھېچقانداق ئۈسكۈنە باغلانمىدى

source: No downloaded files
ug: چۈشۈرۈلگەن ھۆججەت يوق

source: No experiments here
ug: بۇ يەردە سىناق يوق

source: No extensions enabled
ug: كېڭەيتىلمە قوزغىتىلمىغان

source: No extensions here
ug: بۇ يەردە كېڭەيتمە يوق

source: No history here
ug: ھېچقانداق تارىخ خاتىرىسى يوق

source: No info about these reviews yet
ug: بۇ باھالاش توغرىسىدا ھازىرچە ھېچقانداق ئۇچۇر يوق

source: No info available right now
ug: ھازىرچە ھېچقانداق ئۇچۇر يوق

source: No internet connection
ug: تورغا ئۇلانمىغان

source: No network connection
ug: تور باغلىنىشى يوق

source: No open tabs
ug: ئوچۇق بەتكۈچ يوق
